const bu_json = [
  {
    "event1": [
      {
        title: "ชำระเงินค่าลงทะเบียนออนไลน์",
        startDate: "ตั้งแต่วันที่ลงทะเบียน",
        toDate: "14 ธันวาคม 2567 ก่อนเวลา 20.00 น.",
        category: [
          {
            title: "ชำระเงิน (นักศึกษาทั่วไป)",
            link: "https://bupay.bu.ac.th/"
          },
          {
            title: "ชำระเงิน (กรอ./กยศ.)",
            link: "https://findocs.bu.ac.th/scholarloan/RegisterReport.aspx"
          },
          {
            title: "การผ่อนชำระ",
            link: "https://links.bu.ac.th/installment/th/"
          }
        ]
      }
    ]
  },
  {
    "event2": [
      {
        title: "เพิ่ม-ลดวิชา ครั้งที่ 1 และลงทะเบียนเรียนล่าช้า",
        startDate: "7 มกราคม 2568",
        toDate: "8 มกราคม 2568",
        category: [
          {
            title: "สำหรับนักศึกษาที่ ลงทะเบียนออนไลน์ และชำระเงินแล้ว",
            link: "https://rov.bu.ac.th/Account/LogIn?ReturnUrl=%2f",
            schedule: "*วันที่ 7-8 ม.ค. 68 เวลา 9.30-16.00 น."
          },
          {
            title: "สำหรับนักศึกษาที่ ไม่ได้ลงทะเบียนออนไลน์ หรือลงแต่ไม่ได้ชำระเงิน",
            link: "https://rov.bu.ac.th/Account/LogIn?ReturnUrl=%2f",
            schedule: "*วันที่ 7 ม.ค. 68 เวลา 12.30-16.00 น. \n *วันที่ 8 ม.ค. 68 เวลา 9.30-16.00 น."
          },
          {
            title: "สำหรับนักศึกษาที่ ติดเงื่อนไขพิเศษ ลงผ่าน ROV ไม่ได้",
            link: "https://registration.bu.ac.th/thai/extra/",
            schedule: "*วันที่ 7-8 ม.ค. 68 เวลา 9.30-16.00 น.",
            faq: [
              {
                question: "รายวิชาที่ติดเงื่อนไขพิเศษ หมายถึงอะไร",
                answer: "- รายวิชาที่ติดเงื่อนไขพิเศษ หมายถึง รายวิชาที่ติดเงื่อนไขอื่นๆ ที่ไม่ใช่ตารางเรียนชนกัน ตารางสอบชนกัน และลงทะเบียนไม่ผ่านพื้นความรู้ \n - นักศึกษาจะต้องยื่นคำร้อง R4 ขอคำร้องลงทะเบียนวิชาทีติดเงื่อนไขพิเศษ (1 คำร้องต่อ 1 รายวิชา) เพื่อขอลงทะเบียนในวิชาที่ติดเงื่อนไขเท่านั้น เมื่อได้รับอนุมัติจากอาจารย์ ให้เพิ่มรายวิชานั้นที่ 1b. ยื่นคำขอเพิ่มวิชา (Adding Request)"
              },
              {
                question: "กรณีมีรายวิชาที่สามารถลงทะเบียนผ่าน ROV ได้ และมีบางรายวิชาที่ติดเงื่อนไขพิเศษ",
                answer: "1. ให้ลงทะเบียนวิชาที่ไม่ติดเงื่อนไขก่อนที่ 1a. ยื่นคำขอลงทะเบียนล่าช้า (Registration Request) และชำระเงินให้เรียบร้อยก่อน \n 2.เพิ่มรายวิชาที่ติดเงื่อนไขพิเศษ ให้นักศึกษายื่นคำร้อง R4 ขอคำร้องลงทะเบียนวิชาทีติดเงื่อนไขพิเศษ (1 คำร้องต่อ 1 รายวิชา) เพื่อขอลงทะเบียนในวิชาที่ติดเงื่อนไขพิเศษนั้นเมื่อได้รับอนุมัติจากอาจารย์ ให้เพิ่มรายวิชานั้นที่ 1b. ยื่นคำขอเพิ่มวิชา (Adding Request)"
              },
              {
                question: "กรณีทุกรายวิชาที่ต้องการ ลงทะเบียนผ่าน ROV ไม่ได้ (เนื่องจากติดเงื่อนไขพิเศษทุกวิชา)",
                answer: "ให้นักศึกษายื่นคำร้อง R4 ขอคำร้องลงทะเบียนวิชาทีติดเงื่อนไขพิเศษ (1 คำร้องต่อ 1 รายวิชา) เพื่อขอลงทะเบียนในวิชาที่ติดเงื่อนไขพิเศษนั้นเมื่อได้รับอนุมัติจากอาจารย์ ให้เพิ่มรายวิชานั้นที่ 1b. ยื่นคำขอเพิ่มวิชา (Adding Request)"
              },
              {
                question: "นักศึกษาลงทะเบียนล่าช้า หมายถึงอะไร",
                answer: "นักศึกษาลงทะเบียนล่าช้า หมายถึง นักศึกษาที่ไม่เคยลงทะเบียนมาก่อน หรือลงทะเบียนแล้วไม่ได้ชำระเงิน"
              },
              {
                question: "กรณีต้องการขอคำปรึกษาเกี่ยวกับการลงทะเบียน",
                answer: "นักศึกษาสามารถสอบถามข้อมูลได้ที่ https://bulinks.bu.ac.th/point-of-contact"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "event3": [
      {
        title: "เปิดภาคเรียนที่ 2 ปีการศึกษา 2567",
        startDate: "13 มกราคม 2568",
        classSchedule: [
          {
            title: "ตรวจสอบตารางเรียน และห้องเรียน",
            link: "https://freshmen.bu.ac.th/thai/bu-mobile/",
            description: "ตรวจสอบได้ที่ BU APP"
          }
        ]
      }
    ]
  },
  {
    "event4": [
      {
        title: "เพิ่ม-ลดวิชา ครั้งที่ 2 และลงทะเบียนเรียนล่าช้า",
        startDate: "15 มกราคม 2568",
        toDate: "16 มกราคม 2568",
        category: [
          {
            title: "สำหรับนักศึกษาที่ ลงทะเบียนออนไลน์ และชำระเงินแล้ว",
            link: "https://rov.bu.ac.th/Account/LogIn?ReturnUrl=%2f",
            schedule: "*วันที่ 15-16 ม.ค. 68 เวลา 9.30-16.00 น."
          },
          {
            title: "สำหรับนักศึกษาที่ ไม่ได้ลงทะเบียนออนไลน์ หรือลงแต่ไม่ได้ชำระเงิน",
            link: "https://rov.bu.ac.th/Account/LogIn?ReturnUrl=%2f",
            schedule: "*วันที่ 15-16 ม.ค. 68 เวลา 9.30-16.00 น."
          },
          {
            title: "สำหรับนักศึกษาที่ ติดเงื่อนไขพิเศษ ลงผ่าน ROV ไม่ได้",
            link: "https://registration.bu.ac.th/thai/extra/",
            schedule: "*วันที่ 15-16 ม.ค. 68 เวลา 9.30-16.00 น.",
            faq: [
              {
                question: "รายวิชาที่ติดเงื่อนไขพิเศษ หมายถึงอะไร",
                answer: "- รายวิชาที่ติดเงื่อนไขพิเศษ หมายถึง รายวิชาที่ติดเงื่อนไขอื่นๆ ที่ไม่ใช่ตารางเรียนชนกัน ตารางสอบชนกัน และลงทะเบียนไม่ผ่านพื้นความรู้ \n - นักศึกษาจะต้องยื่นคำร้อง R4 ขอคำร้องลงทะเบียนวิชาทีติดเงื่อนไขพิเศษ (1 คำร้องต่อ 1 รายวิชา) เพื่อขอลงทะเบียนในวิชาที่ติดเงื่อนไขเท่านั้น เมื่อได้รับอนุมัติจากอาจารย์ ให้เพิ่มรายวิชานั้นที่ 1b. ยื่นคำขอเพิ่มวิชา (Adding Request)"
              },
              {
                question: "กรณีมีรายวิชาที่สามารถลงทะเบียนผ่าน ROV ได้ และมีบางรายวิชาที่ติดเงื่อนไขพิเศษ",
                answer: "1. ให้ลงทะเบียนวิชาที่ไม่ติดเงื่อนไขก่อนที่ 1a. ยื่นคำขอลงทะเบียนล่าช้า (Registration Request) และชำระเงินให้เรียบร้อยก่อน \n 2.เพิ่มรายวิชาที่ติดเงื่อนไขพิเศษ ให้นักศึกษายื่นคำร้อง R4 ขอคำร้องลงทะเบียนวิชาทีติดเงื่อนไขพิเศษ (1 คำร้องต่อ 1 รายวิชา) เพื่อขอลงทะเบียนในวิชาที่ติดเงื่อนไขพิเศษนั้นเมื่อได้รับอนุมัติจากอาจารย์ ให้เพิ่มรายวิชานั้นที่ 1b. ยื่นคำขอเพิ่มวิชา (Adding Request)"
              },
              {
                question: "กรณีทุกรายวิชาที่ต้องการ ลงทะเบียนผ่าน ROV ไม่ได้ (เนื่องจากติดเงื่อนไขพิเศษทุกวิชา)",
                answer: "ให้นักศึกษายื่นคำร้อง R4 ขอคำร้องลงทะเบียนวิชาทีติดเงื่อนไขพิเศษ (1 คำร้องต่อ 1 รายวิชา) เพื่อขอลงทะเบียนในวิชาที่ติดเงื่อนไขพิเศษนั้นเมื่อได้รับอนุมัติจากอาจารย์ ให้เพิ่มรายวิชานั้นที่ 1b. ยื่นคำขอเพิ่มวิชา (Adding Request)"
              },
              {
                question: "นักศึกษาลงทะเบียนล่าช้า หมายถึงอะไร",
                answer: "นักศึกษาลงทะเบียนล่าช้า หมายถึง นักศึกษาที่ไม่เคยลงทะเบียนมาก่อน หรือลงทะเบียนแล้วไม่ได้ชำระเงิน"
              },
              {
                question: "กรณีต้องการขอคำปรึกษาเกี่ยวกับการลงทะเบียน",
                answer: "นักศึกษาสามารถสอบถามข้อมูลได้ที่ https://bulinks.bu.ac.th/point-of-contact"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    manual: [
      {
        title: "คู่มือการใช้งานระบบลงทะเบียนออนไลน์ ล่าช้า-เพิ่มวิชา และขออนุมัติเพิ่มที่นั่ง",
        link: "https://drive.google.com/file/d/1Sq0Xvxb-EunugtPuw44IKMmhUyfQBmaw/view"
      },
      {
        title: "คู่มือการขอลดวิชาออนไลน์",
        link: "https://drive.google.com/file/d/11tSGJBo5WCbifznubHCeaUvfPYSQ8goA/view"
      }
    ]
  }
];

module.exports = { bu_json };
